test/2D/lbmPoiseuille/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	lbm2Foam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	5;

deltaX				    0.01;

deltaT          	0.001;

writeControl    	timeStep;

writeInterval   	500;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

density				    1000; // [kg/m3]

pressure			    1e5; // [Pa]

//internal			    2;

initScheme        true;

BGKtau            1.2;


// ************************************************************************* //
