test/2D/lbmPoiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     (-3   0  -1)
     ( 3   0  -1)
     ( 3   1  -1)
     (-3   1  -1)
     (-3   0   1)
     ( 3   0   1)
     ( 3   1   1)
     (-3   1   1)
);

blocks
(
     hex (0 1 2 3 4 5 6 7)   (600 1 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

  inlet
  {
    type patch;
    faces
    (
      (0 3 7 4)
    );
  }

  outlet
  {
    type patch;
    faces
    (
      (1 2 6 5)
    );
  }

  topWall
  {
    type wall;
    faces
    (
      (4 5 6 7)
    );
  }

  bottomWall
  {
    type wall;
    faces
    (
      (0 1 2 3)
    );
  }



  frontAndBack
  {
    type empty;
    faces
    (
      (3 7 6 2)
      (0 4 5 1)
    );
  }

);

mergePatchPairs
(
);

// ************************************************************************* //
