test/2D/lbmPoiseuille/0/f_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
465.245
446.582
444.435
444.159
444.312
444.405
444.437
444.445
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           0;
        value           nonuniform List<scalar> 
200
(
457.892
457.431
457.329
457.328
457.339
457.344
457.346
457.345
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           0;
        value           nonuniform List<scalar> 
200
(
444.444
444.444
444.444
444.444
444.444
444.444
444.444
444.444
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           0;
        value           nonuniform List<scalar> 
600
(
465.245
446.582
444.435
444.159
444.312
444.405
444.437
444.445
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           0;
        value           nonuniform List<scalar> 
600
(
465.245
446.582
444.435
444.159
444.312
444.405
444.437
444.445
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
