test/2D/lbmPoiseuille/0/f_3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
127.165
109.981
111.188
111.044
111.092
111.106
111.11
111.111
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           3;
        value           nonuniform List<scalar> 
200
(
94.0761
94.0445
94.0434
94.0445
94.0451
94.0453
94.0453
94.0453
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           3;
        value           nonuniform List<scalar> 
200
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           3;
        value           nonuniform List<scalar> 
600
(
127.165
109.981
111.188
111.044
111.092
111.106
111.11
111.111
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           3;
        value           nonuniform List<scalar> 
600
(
127.165
109.981
111.188
111.044
111.092
111.106
111.11
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
