test/2D/lbmPoiseuille/0/f_5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
34.2409
28.1406
27.5146
27.6699
27.758
27.777
27.7784
27.778
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           5;
        value           nonuniform List<scalar> 
200
(
41.8954
41.8524
41.8456
41.8459
41.8469
41.8473
41.8474
41.8474
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           5;
        value           nonuniform List<scalar> 
200
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           5;
        value           nonuniform List<scalar> 
600
(
36.2798
29.4014
27.7688
27.6184
27.6997
27.7541
27.7734
27.7779
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           5;
        value           nonuniform List<scalar> 
600
(
31.7849
27.4973
27.7972
27.7608
27.7728
27.7764
27.7776
27.7778
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
