test/2D/lbmPoiseuille/0/f_6
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_6;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
33.7798
28.1369
27.7299
27.6988
27.7445
27.7686
27.7764
27.778
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           6;
        value           nonuniform List<scalar> 
200
(
25.5076
23.6544
23.4
23.455
23.4986
23.5111
23.5123
23.5117
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           6;
        value           nonuniform List<scalar> 
200
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           6;
        value           nonuniform List<scalar> 
600
(
31.7859
27.4974
27.7972
27.7608
27.7728
27.7764
27.7776
27.7778
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           6;
        value           nonuniform List<scalar> 
600
(
36.2798
29.4014
27.7688
27.6184
27.6997
27.7541
27.7734
27.7779
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
