test/2D/lbmPoiseuille/0/f_7
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_7;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
31.7868
27.4975
27.7972
27.7609
27.7728
27.7764
27.7776
27.7778
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           7;
        value           nonuniform List<scalar> 
200
(
23.5127
23.509
23.5109
23.5113
23.5114
23.5113
23.5113
23.5113
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           7;
        value           nonuniform List<scalar> 
200
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           7;
        value           nonuniform List<scalar> 
600
(
36.2798
29.4014
27.7688
27.6184
27.6997
27.7541
27.7734
27.7779
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           7;
        value           nonuniform List<scalar> 
600
(
31.7849
27.4973
27.7972
27.7608
27.7728
27.7764
27.7776
27.7778
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
