test/2D/lbmPoiseuille/0/f_8
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_8;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
36.2798
29.4014
27.7688
27.6184
27.6997
27.7541
27.7734
27.7779
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           8;
        value           nonuniform List<scalar> 
200
(
43.8903
41.9978
41.7347
41.7895
41.8342
41.8471
41.8484
41.8478
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           8;
        value           nonuniform List<scalar> 
200
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           8;
        value           nonuniform List<scalar> 
600
(
31.7859
27.4974
27.7972
27.7608
27.7728
27.7764
27.7776
27.7778
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           8;
        value           nonuniform List<scalar> 
600
(
36.2798
29.4014
27.7688
27.6184
27.6997
27.7541
27.7734
27.7779
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
